module.exports = {
  languages: ["ua", "ru", "en"],
  languageRoles: {
    ua: "1081158202193891358",
    ru: "1081159521482850346",
    en: "1081163687731134514",
  },
  welcome: {
    messages: {
      en: [
        "Welcome to the Passion for Coding, fellow coder! We hope you brought your coding skills and your sense of humor, because we love a good coding pun almost as much as we love a well-written line of code. So sit back, grab a virtual cup of coffee, and let's get coding! 💻☕️😂",
        "Greetings, fellow code wizard! You've arrived at the place where bugs go to die and memes go to thrive. Don't worry, we won't judge you for talking to your computer - we all do it here. So grab a virtual drink, settle in, and get ready to code and chill with some awesome like-minded programmers!",
        "Greetings, fellow code wizard! Welcome to our humble abode of memes, bugs, and all things tech. We're excited to have you here, and can't wait to see your programming prowess in action. So pull up a chair, grab a snack, and let's get ready to code our way to glory!",
        "Welcome to the Passion for Coding community, where the code is clean, the bugs are minimal, and the memes are top-notch. We're excited to have you here, so grab a cup of coffee and get ready to code like a boss. And if you're feeling stuck, don't worry - we've got your back, with a team of fellow programmers ready to lend a hand (or a hilarious coding joke). Let's rock this code!",
        "Welcome, programmer! We hope you brought your A-game and your sense of humor, because we're about to tackle some serious coding challenges and crack some hilarious coding jokes. Get ready to join the fun and add your own witty comments to the mix. And remember, the best code is always the one that makes you laugh!",
        "Welcome to the Passion for Coding community, programmer! Brace yourself for an endless stream of memes and code snippets.",
        "Hey there, programmer! We promise not to judge your coding style... unless you use Comic Sans.",
        "Welcome to the club, fellow coder! We hope you brought your sense of humor, because debugging jokes are our specialty.",
        "Greetings, programmer! Our community is like a virtual coffee shop - but instead of caffeine, we're fueled by code and sarcasm.",
        "Welcome aboard, coder! Don't be shy to ask for help or share your latest project. We're all here to learn and laugh together!"
      ],
      ru: [
        "Приветствуем тебя в нашем дискорд сообществе Passion for Codding, программист! Здесь ты найдешь друзей по коду и мемам.",
        "Программист, добро пожаловать! Пожалуйста, соблюдайте чистоту ваших рук и кода.",
        "Привет, коллега по коду! Мы здесь, чтобы помочь тебе стать еще более замечательным, чем ты уже есть.",
        "Рады приветствовать вас, программист! У нас тут крутятся биты и шутки, так что готовьтесь к бесконечному потоку обоих.",
        "Добро пожаловать в наше сообщество, программист! Наша цель - создать мир, где каждый может программировать и жить счастливо. Хотя это скорее сказка, чем реальность.",
        "Приветствуем тебя в нашем Дискорд сообществе, программист! Будь готов к бесконечному потоку мемов и кодовых фрагментов.",
        "Привет, программист! Мы обещаем не осуждать твой стиль кодирования... Пока ты не начнешь использовать шрифт Comic Sans.",
        "Добро пожаловать в клуб, коллега! Мы надеемся, что ты принес свое чувство юмора, потому что у нас специализация на шутках про отладку кода.",
        "Приветствуем тебя в нашей виртуальной кофейне, программист! Мы заряжены не кофеином, а кодом и чувством юмора.",
        "Добро пожаловать на борт, кодер! Не стесняйся просить помощи или демонстрировать свой последний проект. Мы здесь, чтобы учиться и смеяться вместе!"
      ],
      ua: [
        "Вітаємо тебе в нашій діскорд спільноті Passion for coding, програміст! Тут ти знайдеш друзів по коду та мемам",
        "Програміст, ласкаво просимо! Будь ласка, дотримуйтесь чистоти ваших рук і коду.",
        "Привіт, коллега по коду! Ми тут, щоб допомогти тобі стати ще більш чудовим, ніж ти вже є.",
        "Раді вітати вас, програміст! У нас тут вештають біти та жарти, так що готуйся до бескінечного потоку обох.",
        "Ласкаво просимо до нашої спільности, програміст! Наша ціль - створити світ, де кожен може програмувати та жити спокійно. Хоча це скоріш за все казка, ніж реальність.",
        "Ласкаво просимо до нашої спільности, програміст! Будь готовий до бескінечного потоку мемів та фрагментів коду",
        "Привіт, програміст! Ми обіцяємо не засуджувати твій стиль програмування... Поки ти не почнеш використовувати шрифт Comic Sans.",
        "Вітаємо тебе у клубі, коллего! Ми надіємось, що ти приніс гарне почуття гумору, тому що у нас спеціалізація на жарти по налагодженню коду.",
        "Вітаємо тебе у нашій віртуальній кав'ярні, програміст! Ми заряджені не кофеїном, а кодом і почуттям гумору.",
        "Ласкаво просимо на борт, кодер! Не соромся просити про допомогу і презентувати свій останній проект. Ми тут, щоб вчитися і розважатись разом!"
      ],
    },
    buttons: {
      en: "I speak English",
      ru: "Я говорю по русски",
      ua: "Я розмовляю українською"
    },
    replies: {
      en: "Your language set as English",
      ru: "Ваш язык сохранен как русский",
      ua: "Ваша мова збережена як українська"
    }
  }
}